In [1]:
%matplotlib inline

import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

## 自訂dataframe

新dataframe = pd.DataFrame(array,column=項目list)

## 合併dataframe

新dataframe = pd.concat(dataframe的list,axis=0)
 
 *axis控制合併的方向,0是上下(列),1是左右(行)
    
## 更改dataframe的index
dataframe名稱.index = 要給的list

In [2]:
mydata = np.random.randn(4,3)

In [3]:
mydata

array([[-1.1058071 ,  0.04596444, -1.06398464],
       [ 0.15443738,  1.09665461, -0.04892133],
       [-0.2213808 ,  0.96809415,  0.89472568],
       [-0.88948878,  0.09923193, -0.1271696 ]])

In [4]:
list("ABCDE")

['A', 'B', 'C', 'D', 'E']

In [5]:
list("甲乙丙丁")

['甲', '乙', '丙', '丁']

In [6]:
df1 = pd.DataFrame(mydata, columns=list("ABC"))

In [7]:
df1

          A         B         C
0 -1.105807  0.045964 -1.063985
1  0.154437  1.096655 -0.048921
2 -0.221381  0.968094  0.894726
3 -0.889489  0.099232 -0.127170

In [8]:
df2 = pd.DataFrame(np.random.randn(3,3),columns=list("ABC"))

In [9]:
df2

          A         B         C
0  0.943794 -0.979292 -0.026356
1  0.301771  0.846601 -0.306136
2  0.671246  0.574978  1.333033

In [11]:
df3 = pd.concat([df1,df2], axis=0)

In [12]:
df3

          A         B         C
0 -1.105807  0.045964 -1.063985
1  0.154437  1.096655 -0.048921
2 -0.221381  0.968094  0.894726
3 -0.889489  0.099232 -0.127170
0  0.943794 -0.979292 -0.026356
1  0.301771  0.846601 -0.306136
2  0.671246  0.574978  1.333033

In [13]:
df3.index = range(7)

In [14]:
df3

          A         B         C
0 -1.105807  0.045964 -1.063985
1  0.154437  1.096655 -0.048921
2 -0.221381  0.968094  0.894726
3 -0.889489  0.099232 -0.127170
4  0.943794 -0.979292 -0.026356
5  0.301771  0.846601 -0.306136
6  0.671246  0.574978  1.333033

In [15]:
df4 = pd.concat([df1,df2], axis=1)

In [16]:
df4

          A         B         C         A         B         C
0 -1.105807  0.045964 -1.063985  0.943794 -0.979292 -0.026356
1  0.154437  1.096655 -0.048921  0.301771  0.846601 -0.306136
2 -0.221381  0.968094  0.894726  0.671246  0.574978  1.333033
3 -0.889489  0.099232 -0.127170       NaN       NaN       NaN